Revit 2020 API
ViewCropRegionShapeManager.GetSplitRegionMinimum Method
 Returns the proportional location of the minimum boundary of the specified split crop region.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2016
Syntax
C#
public double GetSplitRegionMinimum(
	int regionIndex
)
Visual Basic
Public Function GetSplitRegionMinimum ( _
	regionIndex As Integer _
) As Double
Visual C++
public:
double GetSplitRegionMinimum(
	int regionIndex
)
Parameters
regionIndex
Type: System.Int32
 Index of region to be split horizontally (numbering starts with 0).
Return Value
 A value from 0 to 1 representing the minimum location for the regions split boundary. This number represents the location as a ratio along the non-split rectangular crop.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The provided region index is invalid.
See Also
ViewCropRegionShapeManager Class
Autodesk.Revit.DB Namespace